УТ_для_edt/src/Catalogs/CRM_ВоронкиПродаж/CRM_ВоронкиПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ВоронкиПродаж</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Интересы</name>
      <description>Продажа</description>
    </items>
  </predefined>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭтапа</name>
    <type>
      <types>EnumRef.CRM_ВидыЭтаповВоронкиПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>КартаМаршрута</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
        <types>CatalogRef.CRM_КартыМаршрутов</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
        <types>CatalogRef.CRM_ТочкиМаршрутов</types>
        <types>ChartOfCharacteristicTypesRef.CRM_ВидыОбъектовБизнесПроцессов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантСчетаНаОплату</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_ВоронкиПродаж/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Объект.Ссылка.Пустая() Тогда
		Если	Параметры.Свойство("ЗначениеКопирования")
			И	ТипЗнч(Параметры.ЗначениеКопирования) = Тип("СправочникСсылка.CRM_ВоронкиПродаж")
			И	(Параметры.ЗначениеКопирования.Предопределенный ИЛИ Параметры.ЗначениеКопирования.Родитель.Предопределенный) Тогда
			//
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Копирование предопределенного элемента запрещено!';en='Copying a predefined item prohibited!'"));
			Возврат;
		ИначеЕсли ЗначениеЗаполнено(Объект.Родитель) И Объект.Родитель.Предопределенный Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Изменение состава этапов предопределенного элемента запрещено!';en='Changing stages composition of predefined element prohibited!'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.СценарийИнтереса.Видимость = ЗначениеЗаполнено(Объект.СценарийИнтереса);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИндексЦветаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповещениеНовое = Новый ОписаниеОповещения("ЦветНачалоВыбораЗавершение", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ТекущийЦвет", Объект.ИндексЦвета);
	ФормаВыбораЦвета = ОткрытьФорму("Справочник.CRM_Категории.Форма.ФормаВыбораЦвета", ПараметрыФормы, Элемент,,,,
		ОповещениеНовое, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры // ЦветНачалоВыбора()

&НаКлиенте
// Продолжение процедуры "ЦветНачалоВыбора"
//
Процедура ЦветНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ (Результат = Неопределено) И НЕ (Результат = КодВозвратаДиалога.Отмена) Тогда
		Объект.ИндексЦвета = Результат[0].Картинка;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти
